// Задача №1
// Напишите программу которая принимает на вход три числа и проверяет может ли существовать треугольник со сторонами такой длины
// Теорема о неравенстве треуголника: каждая сторона треугольника меньше суммы двух других сторон

// Console.WriteLine("Введите первое число");
// int num1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите первое число");
// int num2 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите первое число");
// int num3 = Convert.ToInt32(Console.ReadLine());

// if (((num1 < (num2 + num3)) && (num2 < (num1 + num3)) && (num3 < (num1 + num2))))
// {
//     Console.WriteLine("Да");
// }
// else
// {
//     Console.WriteLine("Нет");
// }